betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_smc.c
/**
  *
  * @file    apm32f4xx_ddl_smc.c
  * @brief   SMC Low Layer DDL module driver.
  *
  *          This file provides firmware functions to manage the following
  *          functionalities of the Static Memory Controller (SMC) peripheral memories:
  *           + Initialization/de-initialization functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  @verbatim
  ==============================================================================
                        ##### SMC peripheral features #####
  ==============================================================================
  [..] The Static memory controller (SMC) includes following memory controllers:
       (+) The NOR/PSRAM memory controller
       (+) The NAND/PC Card memory controller

  [..] The SMC functional block makes the interface with synchronous and asynchronous static
       memories and 16-bit PC memory cards. Its main purposes are:
       (+) to translate AHB transactions into the appropriate external device protocol
       (+) to meet the access time requirements of the external memory devices

  [..] All external memories share the addresses, data and control signals with the controller.
       Each external device is accessed by means of a unique Chip Select. The SMC performs
       only one access at a time to an external device.
       The main features of the SMC controller are the following:
        (+) Interface with static-memory mapped devices including:
           (++) Static random access memory (SRAM)
           (++) Read-only memory (ROM)
           (++) NOR Flash memory/OneNAND Flash memory
           (++) PSRAM (4 memory banks)
           (++) 16-bit PC Card compatible devices
           (++) Two banks of NAND Flash memory with ECC hardware to check up to 8 Kbytes of
                data
        (+) Independent Chip Select control for each memory bank
        (+) Independent configuration for each memory bank

  @endverbatim
  *
  */

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */
#if defined(DAL_NOR_MODULE_ENABLED) || defined(DAL_SRAM_MODULE_ENABLED) || defined(DAL_NAND_MODULE_ENABLED) || defined(DAL_PCCARD_MODULE_ENABLED)

/** @defgroup SMC_DDL SMC Low Layer
  * @brief SMC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/** @defgroup SMC_DDL_Private_Constants SMC Low Layer Private Constants
  * @{
  */

/* ----------------------- SMC registers bit mask --------------------------- */

#if defined(SMC_Bank1)
/* --- BCR Register ---*/
/* BCR register clear mask */

/* --- BTR Register ---*/
/* BTR register clear mask */
#define BTR_CLEAR_MASK    ((uint32_t)(SMC_CSTIM1_ADDRSETCFG | SMC_CSTIM1_ADDRHLDCFG  |\
                                      SMC_CSTIM1_DATASETCFG | SMC_CSTIM1_BUSTURNCFG |\
                                      SMC_CSTIM1_CLKDIVCFG | SMC_CSTIM1_DATALATCFG  |\
                                      SMC_CSTIM1_ASYNCACCCFG))

/* --- BWTR Register ---*/
/* BWTR register clear mask */
#define BWTR_CLEAR_MASK   ((uint32_t)(SMC_WRTTIM1_ADDRSETCFG | SMC_WRTTIM1_ADDRHLDCFG  |\
                                      SMC_WRTTIM1_DATASETCFG | SMC_WRTTIM1_BUSTURNCFG |\
                                      SMC_WRTTIM1_ASYNCACCCFG))
#endif /* SMC_Bank1 */
#if defined(SMC_Bank2_3)
/* --- PCR Register ---*/
/* PCR register clear mask */
#define PCR_CLEAR_MASK    ((uint32_t)(SMC_CTRL2_WAITFEN | SMC_CTRL2_MBKEN  | \
                                      SMC_CTRL2_MTYPECFG    | SMC_CTRL2_DBWIDCFG   | \
                                      SMC_CTRL2_ECCEN   | SMC_CTRL2_C2RDCFG   | \
                                      SMC_CTRL2_A2RDCFG     | SMC_CTRL2_ECCPSCFG))
/* --- PMEM Register ---*/
/* PMEM register clear mask */
#define PMEM_CLEAR_MASK   ((uint32_t)(SMC_CMSTIM2_SET2  | SMC_CMSTIM2_WAIT2 |\
                                      SMC_CMSTIM2_HLD2 | SMC_CMSTIM2_HIZ2))

/* --- PATT Register ---*/
/* PATT register clear mask */
#define PATT_CLEAR_MASK   ((uint32_t)(SMC_AMSTIM2_SET2  | SMC_AMSTIM2_WAIT2 |\
                                      SMC_AMSTIM2_HLD2 | SMC_AMSTIM2_HIZ2))

#endif /* SMC_Bank2_3 */
#if defined(SMC_Bank4)
/* --- PCR Register ---*/
/* PCR register clear mask */
#define PCR4_CLEAR_MASK   ((uint32_t)(SMC_CTRL4_WAITFEN | SMC_CTRL4_MBKEN  | \
                                      SMC_CTRL4_MTYPECFG    | SMC_CTRL4_DBWIDCFG   | \
                                      SMC_CTRL4_ECCEN   | SMC_CTRL4_C2RDCFG   | \
                                      SMC_CTRL4_A2RDCFG     | SMC_CTRL4_ECCPSCFG))
/* --- PMEM Register ---*/
/* PMEM register clear mask */
#define PMEM4_CLEAR_MASK  ((uint32_t)(SMC_CMSTIM4_SET4  | SMC_CMSTIM4_WAIT4 |\
                                      SMC_CMSTIM4_HLD4 | SMC_CMSTIM4_HIZ4))

/* --- PATT Register ---*/
/* PATT register clear mask */
#define PATT4_CLEAR_MASK  ((uint32_t)(SMC_AMSTIM4_SET4  | SMC_AMSTIM4_WAIT4 |\
                                      SMC_AMSTIM4_HLD4 | SMC_AMSTIM4_HIZ4))

/* --- PIO4 Register ---*/
/* PIO4 register clear mask */
#define PIO4_CLEAR_MASK   ((uint32_t)(SMC_IOSTIM4_SET4  | SMC_IOSTIM4_WAIT4 | \
                                      SMC_IOSTIM4_HLD4 | SMC_IOSTIM4_HIZ4))

