betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_smc.c
#endif /* SMC_Bank4 */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/** @defgroup SMC_DDL_Exported_Functions SMC Low Layer Exported Functions
  * @{
  */

#if defined(SMC_Bank1)

/** @defgroup SMC_DDL_Exported_Functions_NORSRAM SMC Low Layer NOR SRAM Exported Functions
  * @brief  NORSRAM Controller functions
  *
  @verbatim
  ==============================================================================
                   ##### How to use NORSRAM device driver #####
  ==============================================================================

  [..]
    This driver contains a set of APIs to interface with the SMC NORSRAM banks in order
    to run the NORSRAM external devices.

    (+) SMC NORSRAM bank reset using the function SMC_NORSRAM_DeInit()
    (+) SMC NORSRAM bank control configuration using the function SMC_NORSRAM_Init()
    (+) SMC NORSRAM bank timing configuration using the function SMC_NORSRAM_Timing_Init()
    (+) SMC NORSRAM bank extended timing configuration using the function
        SMC_NORSRAM_Extended_Timing_Init()
    (+) SMC NORSRAM bank enable/disable write operation using the functions
        SMC_NORSRAM_WriteOperation_Enable()/SMC_NORSRAM_WriteOperation_Disable()

@endverbatim
  * @{
  */

/** @defgroup SMC_DDL_NORSRAM_Exported_Functions_Group1 Initialization and de-initialization functions
  * @brief    Initialization and Configuration functions
  *
  @verbatim
  ==============================================================================
              ##### Initialization and de_initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the SMC NORSRAM interface
    (+) De-initialize the SMC NORSRAM interface
    (+) Configure the SMC clock and associated GPIOs

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the SMC_NORSRAM device according to the specified
  *         control parameters in the SMC_NORSRAM_InitTypeDef
  * @param  Device Pointer to NORSRAM device instance
  * @param  Init Pointer to NORSRAM Initialization structure
  * @retval DAL status
  */
DAL_StatusTypeDef  SMC_NORSRAM_Init(SMC_NORSRAM_TypeDef *Device,
                                    SMC_NORSRAM_InitTypeDef *Init)
{
  uint32_t flashaccess;
  uint32_t btcr_reg;
  uint32_t mask;

  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NORSRAM_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Init->NSBank));
  ASSERT_PARAM(IS_SMC_MUX(Init->DataAddressMux));
  ASSERT_PARAM(IS_SMC_MEMORY(Init->MemoryType));
  ASSERT_PARAM(IS_SMC_NORSRAM_MEMORY_WIDTH(Init->MemoryDataWidth));
  ASSERT_PARAM(IS_SMC_BURSTMODE(Init->BurstAccessMode));
  ASSERT_PARAM(IS_SMC_WAIT_POLARITY(Init->WaitSignalPolarity));
#if defined(SMC_CSCTRL1_WRAPBEN)
  ASSERT_PARAM(IS_SMC_WRAP_MODE(Init->WrapMode));
#endif /* SMC_CSCTRL1_WRAPBEN */
  ASSERT_PARAM(IS_SMC_WAIT_SIGNAL_ACTIVE(Init->WaitSignalActive));
  ASSERT_PARAM(IS_SMC_WRITE_OPERATION(Init->WriteOperation));
  ASSERT_PARAM(IS_SMC_WAITE_SIGNAL(Init->WaitSignal));
  ASSERT_PARAM(IS_SMC_EXTENDED_MODE(Init->ExtendedMode));
  ASSERT_PARAM(IS_SMC_ASYNWAIT(Init->AsynchronousWait));
  ASSERT_PARAM(IS_SMC_WRITE_BURST(Init->WriteBurst));
  ASSERT_PARAM(IS_SMC_PAGESIZE(Init->PageSize));

  /* Disable NORSRAM Device */
  __SMC_NORSRAM_DISABLE(Device, Init->NSBank);

  /* Set NORSRAM device control parameters */
  if (Init->MemoryType == SMC_MEMORY_TYPE_NOR)
  {
    flashaccess = SMC_NORSRAM_FLASH_ACCESS_ENABLE;
  }
  else
  {
    flashaccess = SMC_NORSRAM_FLASH_ACCESS_DISABLE;
  }

  btcr_reg = (flashaccess                   | \
              Init->DataAddressMux          | \
              Init->MemoryType              | \
              Init->MemoryDataWidth         | \
              Init->BurstAccessMode         | \
              Init->WaitSignalPolarity      | \
              Init->WaitSignalActive        | \
              Init->WriteOperation          | \
              Init->WaitSignal              | \
              Init->ExtendedMode            | \
              Init->AsynchronousWait        | \
              Init->WriteBurst);

#if defined(SMC_CSCTRL1_WRAPBEN)
  btcr_reg |= Init->WrapMode;
#endif /* SMC_CSCTRL1_WRAPBEN */

  btcr_reg |= Init->PageSize;

  mask = (SMC_CSCTRL1_MBKEN                |
          SMC_CSCTRL1_ADMUXEN                |
          SMC_CSCTRL1_MTYPECFG                 |
          SMC_CSCTRL1_MDBWIDCFG                 |
          SMC_CSCTRL1_NORFMACCEN               |
          SMC_CSCTRL1_BURSTEN              |
          SMC_CSCTRL1_WSPOLCFG              |
          SMC_CSCTRL1_WTIMCFG              |
          SMC_CSCTRL1_WREN                 |
          SMC_CSCTRL1_WAITEN               |
          SMC_CSCTRL1_EXTMODEEN               |
          SMC_CSCTRL1_WSASYNCEN            |
          SMC_CSCTRL1_WRBURSTEN);

#if defined(SMC_CSCTRL1_WRAPBEN)
  mask |= SMC_CSCTRL1_WRAPBEN;
#endif /* SMC_CSCTRL1_WRAPBEN */

  mask |= SMC_CSCTRL1_CRAMPSIZECFG;

  MODIFY_REG(Device->CSCTRL[Init->NSBank], mask, btcr_reg);

  return DAL_OK;
}

/**
  * @brief  DeInitialize the SMC_NORSRAM peripheral
  * @param  Device Pointer to NORSRAM device instance
  * @param  ExDevice Pointer to NORSRAM extended mode device instance
  * @param  Bank NORSRAM bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NORSRAM_DeInit(SMC_NORSRAM_TypeDef *Device,
                                     SMC_NORSRAM_EXTENDED_TypeDef *ExDevice, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NORSRAM_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NORSRAM_EXTENDED_DEVICE(ExDevice));
  ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Bank));

  /* Disable the SMC_NORSRAM device */
  __SMC_NORSRAM_DISABLE(Device, Bank);

  /* De-initialize the SMC_NORSRAM device */
  /* SMC_NORSRAM_BANK1 */
  if (Bank == SMC_NORSRAM_BANK1)
  {
    Device->CSCTRL[Bank] = 0x000030DBU;
  }
  /* SMC_NORSRAM_BANK2, SMC_NORSRAM_BANK3 or SMC_NORSRAM_BANK4 */
  else
  {
    Device->CSCTRL[Bank] = 0x000030D2U;
  }

  Device->CSCTRL[Bank + 1U] = 0x0FFFFFFFU;
  ExDevice->WRTTIM[Bank]   = 0x0FFFFFFFU;

  return DAL_OK;
}

/**
  * @brief  Initialize the SMC_NORSRAM Timing according to the specified
  *         parameters in the SMC_NORSRAM_TimingTypeDef
  * @param  Device Pointer to NORSRAM device instance
  * @param  Timing Pointer to NORSRAM Timing structure
  * @param  Bank NORSRAM bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NORSRAM_Timing_Init(SMC_NORSRAM_TypeDef *Device,
                                          SMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NORSRAM_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_ADDRESS_SETUP_TIME(Timing->AddressSetupTime));
  ASSERT_PARAM(IS_SMC_ADDRESS_HOLD_TIME(Timing->AddressHoldTime));
  ASSERT_PARAM(IS_SMC_DATASETUP_TIME(Timing->DataSetupTime));
  ASSERT_PARAM(IS_SMC_TURNAROUND_TIME(Timing->BusTurnAroundDuration));
  ASSERT_PARAM(IS_SMC_CLK_DIV(Timing->CLKDivision));
  ASSERT_PARAM(IS_SMC_DATA_LATENCY(Timing->DataLatency));
  ASSERT_PARAM(IS_SMC_ACCESS_MODE(Timing->AccessMode));
  ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Bank));

  /* Set SMC_NORSRAM device timing parameters */
  MODIFY_REG(Device->CSCTRL[Bank + 1U], BTR_CLEAR_MASK, (Timing->AddressSetupTime                                  |
                                                       ((Timing->AddressHoldTime)        << SMC_CSTIM1_ADDRHLDCFG_Pos)  |
                                                       ((Timing->DataSetupTime)          << SMC_CSTIM1_DATASETCFG_Pos)  |
                                                       ((Timing->BusTurnAroundDuration)  << SMC_CSTIM1_BUSTURNCFG_Pos) |
                                                       (((Timing->CLKDivision) - 1U)     << SMC_CSTIM1_CLKDIVCFG_Pos)  |
                                                       (((Timing->DataLatency) - 2U)     << SMC_CSTIM1_DATALATCFG_Pos)  |
                                                       (Timing->AccessMode)));

  return DAL_OK;
}

/**
  * @brief  Initialize the SMC_NORSRAM Extended mode Timing according to the specified
  *         parameters in the SMC_NORSRAM_TimingTypeDef
  * @param  Device Pointer to NORSRAM device instance
  * @param  Timing Pointer to NORSRAM Timing structure
  * @param  Bank NORSRAM bank number
  * @param  ExtendedMode SMC Extended Mode
  *          This parameter can be one of the following values:
  *            @arg SMC_EXTENDED_MODE_DISABLE
  *            @arg SMC_EXTENDED_MODE_ENABLE
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NORSRAM_Extended_Timing_Init(SMC_NORSRAM_EXTENDED_TypeDef *Device,
                                                   SMC_NORSRAM_TimingTypeDef *Timing, uint32_t Bank,
                                                   uint32_t ExtendedMode)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_EXTENDED_MODE(ExtendedMode));

  /* Set NORSRAM device timing register for write configuration, if extended mode is used */
  if (ExtendedMode == SMC_EXTENDED_MODE_ENABLE)
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_SMC_NORSRAM_EXTENDED_DEVICE(Device));
    ASSERT_PARAM(IS_SMC_ADDRESS_SETUP_TIME(Timing->AddressSetupTime));
    ASSERT_PARAM(IS_SMC_ADDRESS_HOLD_TIME(Timing->AddressHoldTime));
    ASSERT_PARAM(IS_SMC_DATASETUP_TIME(Timing->DataSetupTime));
    ASSERT_PARAM(IS_SMC_TURNAROUND_TIME(Timing->BusTurnAroundDuration));
    ASSERT_PARAM(IS_SMC_ACCESS_MODE(Timing->AccessMode));
    ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Bank));

    /* Set NORSRAM device timing register for write configuration, if extended mode is used */
    MODIFY_REG(Device->WRTTIM[Bank], BWTR_CLEAR_MASK, (Timing->AddressSetupTime                                    |
                                                     ((Timing->AddressHoldTime)        << SMC_WRTTIM1_ADDRHLDCFG_Pos)  |
                                                     ((Timing->DataSetupTime)          << SMC_WRTTIM1_DATASETCFG_Pos)  |
                                                     Timing->AccessMode                                          |
                                                     ((Timing->BusTurnAroundDuration)  << SMC_WRTTIM1_BUSTURNCFG_Pos)));
  }
  else
  {
    Device->WRTTIM[Bank] = 0x0FFFFFFFU;
  }

  return DAL_OK;
}
/**
  * @}
  */

/** @addtogroup SMC_DDL_NORSRAM_Private_Functions_Group2
  *  @brief   management functions
  *
@verbatim
  ==============================================================================
                      ##### SMC_NORSRAM Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control dynamically
    the SMC NORSRAM interface.

@endverbatim
  * @{
  */

/**
  * @brief  Enables dynamically SMC_NORSRAM write operation.
  * @param  Device Pointer to NORSRAM device instance
  * @param  Bank NORSRAM bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NORSRAM_WriteOperation_Enable(SMC_NORSRAM_TypeDef *Device, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NORSRAM_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Bank));

  /* Enable write operation */
  SET_BIT(Device->CSCTRL[Bank], SMC_WRITE_OPERATION_ENABLE);

  return DAL_OK;
}

/**
  * @brief  Disables dynamically SMC_NORSRAM write operation.
  * @param  Device Pointer to NORSRAM device instance
  * @param  Bank NORSRAM bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NORSRAM_WriteOperation_Disable(SMC_NORSRAM_TypeDef *Device, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NORSRAM_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NORSRAM_BANK(Bank));

  /* Disable write operation */
  CLEAR_BIT(Device->CSCTRL[Bank], SMC_WRITE_OPERATION_ENABLE);

  return DAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* SMC_Bank1 */

#if defined(SMC_Bank2_3)

/** @defgroup SMC_DDL_Exported_Functions_NAND SMC Low Layer NAND Exported Functions
  * @brief    NAND Controller functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use NAND device driver #####
  ==============================================================================
  [..]
    This driver contains a set of APIs to interface with the SMC NAND banks in order
    to run the NAND external devices.

    (+) SMC NAND bank reset using the function SMC_NAND_DeInit()
    (+) SMC NAND bank control configuration using the function SMC_NAND_Init()
    (+) SMC NAND bank common space timing configuration using the function
        SMC_NAND_CommonSpace_Timing_Init()
    (+) SMC NAND bank attribute space timing configuration using the function
        SMC_NAND_AttributeSpace_Timing_Init()
    (+) SMC NAND bank enable/disable ECC correction feature using the functions
        SMC_NAND_ECC_Enable()/SMC_NAND_ECC_Disable()
    (+) SMC NAND bank get ECC correction code using the function SMC_NAND_GetECC()

@endverbatim
  * @{
  */

/** @defgroup SMC_DDL_NAND_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
  ==============================================================================
              ##### Initialization and de_initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the SMC NAND interface
    (+) De-initialize the SMC NAND interface
    (+) Configure the SMC clock and associated GPIOs

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SMC_NAND device according to the specified
  *         control parameters in the SMC_NAND_HandleTypeDef
  * @param  Device Pointer to NAND device instance
  * @param  Init Pointer to NAND Initialization structure
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_Init(SMC_NAND_TypeDef *Device, SMC_NAND_InitTypeDef *Init)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Init->NandBank));
  ASSERT_PARAM(IS_SMC_WAIT_FEATURE(Init->Waitfeature));
  ASSERT_PARAM(IS_SMC_NAND_MEMORY_WIDTH(Init->MemoryDataWidth));
  ASSERT_PARAM(IS_SMC_ECC_STATE(Init->EccComputation));
  ASSERT_PARAM(IS_SMC_ECCPAGE_SIZE(Init->ECCPageSize));
  ASSERT_PARAM(IS_SMC_TCLR_TIME(Init->TCLRSetupTime));
  ASSERT_PARAM(IS_SMC_TAR_TIME(Init->TARSetupTime));

  /* Set NAND device control parameters */
  if (Init->NandBank == SMC_NAND_BANK2)
  {
    /* NAND bank 2 registers configuration */
    MODIFY_REG(Device->CTRL2, PCR_CLEAR_MASK, (Init->Waitfeature                                      |
                                              SMC_PCR_MEMORY_TYPE_NAND                               |
                                              Init->MemoryDataWidth                                  |
                                              Init->EccComputation                                   |
                                              Init->ECCPageSize                                      |
                                              ((Init->TCLRSetupTime) << SMC_CTRL2_C2RDCFG_Pos) |
                                              ((Init->TARSetupTime)  << SMC_CTRL2_A2RDCFG_Pos)));
  }
  else
  {
    /* NAND bank 3 registers configuration */
    MODIFY_REG(Device->CTRL3, PCR_CLEAR_MASK, (Init->Waitfeature                                      |
                                              SMC_PCR_MEMORY_TYPE_NAND                               |
                                              Init->MemoryDataWidth                                  |
                                              Init->EccComputation                                   |
                                              Init->ECCPageSize                                      |
                                              ((Init->TCLRSetupTime) << SMC_CTRL2_C2RDCFG_Pos)  |
                                              ((Init->TARSetupTime)  << SMC_CTRL2_A2RDCFG_Pos)));
  }

  return DAL_OK;
}

/**
  * @brief  Initializes the SMC_NAND Common space Timing according to the specified
  *         parameters in the SMC_NAND_PCC_TimingTypeDef
  * @param  Device Pointer to NAND device instance
  * @param  Timing Pointer to NAND timing structure
  * @param  Bank NAND bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_CommonSpace_Timing_Init(SMC_NAND_TypeDef *Device,
                                                   SMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_SETUP_TIME(Timing->SetupTime));
  ASSERT_PARAM(IS_SMC_WAIT_TIME(Timing->WaitSetupTime));
  ASSERT_PARAM(IS_SMC_HOLD_TIME(Timing->HoldSetupTime));
  ASSERT_PARAM(IS_SMC_HIZ_TIME(Timing->HiZSetupTime));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

  /* Set SMC_NAND device timing parameters */
  if (Bank == SMC_NAND_BANK2)
  {
    /* NAND bank 2 registers configuration */
    MODIFY_REG(Device->CMSTIM2, PMEM_CLEAR_MASK, (Timing->SetupTime                                             |
                                                ((Timing->WaitSetupTime) << SMC_CMSTIM2_WAIT2_Pos) |
                                                ((Timing->HoldSetupTime) << SMC_CMSTIM2_HLD2_Pos) |
                                                ((Timing->HiZSetupTime)  << SMC_CMSTIM2_HIZ2_Pos)));
  }
  else
  {
    /* NAND bank 3 registers configuration */
    MODIFY_REG(Device->CMSTIM3, PMEM_CLEAR_MASK, (Timing->SetupTime                                             |
                                                ((Timing->WaitSetupTime) << SMC_CMSTIM3_WAIT3_Pos) |
                                                ((Timing->HoldSetupTime) << SMC_CMSTIM3_HLD3_Pos) |
                                                ((Timing->HiZSetupTime)  << SMC_CMSTIM3_HIZ3_Pos)));
  }

  return DAL_OK;
}

/**
  * @brief  Initializes the SMC_NAND Attribute space Timing according to the specified
  *         parameters in the SMC_NAND_PCC_TimingTypeDef
  * @param  Device Pointer to NAND device instance
  * @param  Timing Pointer to NAND timing structure
  * @param  Bank NAND bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_AttributeSpace_Timing_Init(SMC_NAND_TypeDef *Device,
                                                      SMC_NAND_PCC_TimingTypeDef *Timing, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_SETUP_TIME(Timing->SetupTime));
  ASSERT_PARAM(IS_SMC_WAIT_TIME(Timing->WaitSetupTime));
  ASSERT_PARAM(IS_SMC_HOLD_TIME(Timing->HoldSetupTime));
  ASSERT_PARAM(IS_SMC_HIZ_TIME(Timing->HiZSetupTime));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

  /* Set SMC_NAND device timing parameters */
  if (Bank == SMC_NAND_BANK2)
  {
    /* NAND bank 2 registers configuration */
    MODIFY_REG(Device->AMSTIM2, PATT_CLEAR_MASK, (Timing->SetupTime                                             |
                                                ((Timing->WaitSetupTime) << SMC_AMSTIM2_WAIT2_Pos) |
                                                ((Timing->HoldSetupTime) << SMC_AMSTIM2_HLD2_Pos) |
                                                ((Timing->HiZSetupTime)  << SMC_AMSTIM2_HIZ2_Pos)));
  }
  else
  {
    /* NAND bank 3 registers configuration */
    MODIFY_REG(Device->AMSTIM3, PATT_CLEAR_MASK, (Timing->SetupTime                                             |
                                                ((Timing->WaitSetupTime) << SMC_AMSTIM3_WAIT3_Pos) |
                                                ((Timing->HoldSetupTime) << SMC_AMSTIM3_HLD3_Pos) |
                                                ((Timing->HiZSetupTime)  << SMC_AMSTIM3_HIZ3_Pos)));
  }

  return DAL_OK;
}

/**
  * @brief  DeInitializes the SMC_NAND device
  * @param  Device Pointer to NAND device instance
  * @param  Bank NAND bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_DeInit(SMC_NAND_TypeDef *Device, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

  /* Disable the NAND Bank */
  __SMC_NAND_DISABLE(Device, Bank);

  /* De-initialize the NAND Bank */
  if (Bank == SMC_NAND_BANK2)
  {
    /* Set the SMC_NAND_BANK2 registers to their reset values */
    WRITE_REG(Device->CTRL2,  0x00000018U);
    WRITE_REG(Device->STSINT2,   0x00000040U);
    WRITE_REG(Device->CMSTIM2, 0xFCFCFCFCU);
    WRITE_REG(Device->AMSTIM2, 0xFCFCFCFCU);
  }
  /* SMC_Bank3_NAND */
  else
  {
    /* Set the SMC_NAND_BANK3 registers to their reset values */
    WRITE_REG(Device->CTRL3,  0x00000018U);
    WRITE_REG(Device->STSINT3,   0x00000040U);
    WRITE_REG(Device->CMSTIM3, 0xFCFCFCFCU);
    WRITE_REG(Device->AMSTIM3, 0xFCFCFCFCU);
  }

  return DAL_OK;
}

/**
  * @}
  */

/** @defgroup DAL_SMC_NAND_Group2 Peripheral Control functions
  *  @brief   management functions
  *
@verbatim
  ==============================================================================
                       ##### SMC_NAND Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control dynamically
    the SMC NAND interface.

@endverbatim
  * @{
  */


/**
  * @brief  Enables dynamically SMC_NAND ECC feature.
  * @param  Device Pointer to NAND device instance
  * @param  Bank NAND bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_ECC_Enable(SMC_NAND_TypeDef *Device, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

