betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_smc.c
  /* Enable ECC feature */
  if (Bank == SMC_NAND_BANK2)
  {
    SET_BIT(Device->CTRL2, SMC_CTRL2_ECCEN);
  }
  else
  {
    SET_BIT(Device->CTRL3, SMC_CTRL3_ECCEN);
  }

  return DAL_OK;
}


/**
  * @brief  Disables dynamically SMC_NAND ECC feature.
  * @param  Device Pointer to NAND device instance
  * @param  Bank NAND bank number
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_ECC_Disable(SMC_NAND_TypeDef *Device, uint32_t Bank)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

  /* Disable ECC feature */
  if (Bank == SMC_NAND_BANK2)
  {
    CLEAR_BIT(Device->CTRL2, SMC_CTRL2_ECCEN);
  }
  else
  {
    CLEAR_BIT(Device->CTRL3, SMC_CTRL3_ECCEN);
  }

  return DAL_OK;
}

/**
  * @brief  Disables dynamically SMC_NAND ECC feature.
  * @param  Device Pointer to NAND device instance
  * @param  ECCval Pointer to ECC value
  * @param  Bank NAND bank number
  * @param  Timeout Timeout wait value
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_NAND_GetECC(SMC_NAND_TypeDef *Device, uint32_t *ECCval, uint32_t Bank,
                                  uint32_t Timeout)
{
  uint32_t tickstart;

  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_NAND_DEVICE(Device));
  ASSERT_PARAM(IS_SMC_NAND_BANK(Bank));

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Wait until FIFO is empty */
  while (__SMC_NAND_GET_FLAG(Device, Bank, SMC_FLAG_FEMPT) == RESET)
  {
    /* Check for the Timeout */
    if (Timeout != DAL_MAX_DELAY)
    {
      if (((DAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
      {
        return DAL_TIMEOUT;
      }
    }
  }

  if (Bank == SMC_NAND_BANK2)
  {
    /* Get the ECCRS2 register value */
    *ECCval = (uint32_t)Device->ECCRS2;
  }
  else
  {
    /* Get the ECCRS3 register value */
    *ECCval = (uint32_t)Device->ECCRS3;
  }

  return DAL_OK;
}

/**
  * @}
  */
#endif /* SMC_Bank2_3 */

#if defined(SMC_Bank4)

/** @addtogroup SMC_DDL_PCCARD
  * @brief    PCCARD Controller functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use PCCARD device driver #####
  ==============================================================================
  [..]
    This driver contains a set of APIs to interface with the SMC PCCARD bank in order
    to run the PCCARD/compact flash external devices.

    (+) SMC PCCARD bank reset using the function SMC_PCCARD_DeInit()
    (+) SMC PCCARD bank control configuration using the function SMC_PCCARD_Init()
    (+) SMC PCCARD bank common space timing configuration using the function
        SMC_PCCARD_CommonSpace_Timing_Init()
    (+) SMC PCCARD bank attribute space timing configuration using the function
        SMC_PCCARD_AttributeSpace_Timing_Init()
    (+) SMC PCCARD bank IO space timing configuration using the function
        SMC_PCCARD_IOSpace_Timing_Init()
@endverbatim
  * @{
  */

/** @addtogroup SMC_DDL_PCCARD_Private_Functions_Group1
  *  @brief    Initialization and Configuration functions
  *
@verbatim
  ==============================================================================
              ##### Initialization and de_initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to:
    (+) Initialize and configure the SMC PCCARD interface
    (+) De-initialize the SMC PCCARD interface
    (+) Configure the SMC clock and associated GPIOs

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SMC_PCCARD device according to the specified
  *         control parameters in the SMC_PCCARD_HandleTypeDef
  * @param  Device Pointer to PCCARD device instance
  * @param  Init Pointer to PCCARD Initialization structure
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_PCCARD_Init(SMC_PCCARD_TypeDef *Device, SMC_PCCARD_InitTypeDef *Init)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_PCCARD_DEVICE(Device));
#if defined(SMC_Bank2_3)
  ASSERT_PARAM(IS_SMC_WAIT_FEATURE(Init->Waitfeature));
  ASSERT_PARAM(IS_SMC_TCLR_TIME(Init->TCLRSetupTime));
  ASSERT_PARAM(IS_SMC_TAR_TIME(Init->TARSetupTime));
#endif /* SMC_Bank2_3 */

  /* Set SMC_PCCARD device control parameters */
  MODIFY_REG(Device->CTRL4,
             (SMC_CTRL4_MTYPECFG                                          |
              SMC_CTRL4_WAITFEN                                       |
              SMC_CTRL4_DBWIDCFG                                          |
              SMC_CTRL4_C2RDCFG                                          |
              SMC_CTRL4_A2RDCFG),
             (SMC_PCR_MEMORY_TYPE_PCCARD                             |
              Init->Waitfeature                                      |
              SMC_NAND_PCC_MEM_BUS_WIDTH_16                          |
              (Init->TCLRSetupTime << SMC_CTRL4_C2RDCFG_Pos)   |
              (Init->TARSetupTime  << SMC_CTRL4_A2RDCFG_Pos)));

  return DAL_OK;
}

/**
  * @brief  Initializes the SMC_PCCARD Common space Timing according to the specified
  *         parameters in the SMC_NAND_PCC_TimingTypeDef
  * @param  Device Pointer to PCCARD device instance
  * @param  Timing Pointer to PCCARD timing structure
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_PCCARD_CommonSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                              SMC_NAND_PCC_TimingTypeDef *Timing)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_PCCARD_DEVICE(Device));
#if defined(SMC_Bank2_3)
  ASSERT_PARAM(IS_SMC_SETUP_TIME(Timing->SetupTime));
  ASSERT_PARAM(IS_SMC_WAIT_TIME(Timing->WaitSetupTime));
  ASSERT_PARAM(IS_SMC_HOLD_TIME(Timing->HoldSetupTime));
  ASSERT_PARAM(IS_SMC_HIZ_TIME(Timing->HiZSetupTime));
#endif /* SMC_Bank2_3 */

  /* Set PCCARD timing parameters */
  MODIFY_REG(Device->CMSTIM4, PMEM4_CLEAR_MASK,
             (Timing->SetupTime                                              |
              ((Timing->WaitSetupTime) << SMC_CMSTIM4_WAIT4_Pos)  |
              ((Timing->HoldSetupTime) << SMC_CMSTIM4_HLD4_Pos)  |
              ((Timing->HiZSetupTime)  << SMC_CMSTIM4_HIZ4_Pos)));

  return DAL_OK;
}

/**
  * @brief  Initializes the SMC_PCCARD Attribute space Timing according to the specified
  *         parameters in the SMC_NAND_PCC_TimingTypeDef
  * @param  Device Pointer to PCCARD device instance
  * @param  Timing Pointer to PCCARD timing structure
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_PCCARD_AttributeSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                                 SMC_NAND_PCC_TimingTypeDef *Timing)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_PCCARD_DEVICE(Device));
#if defined(SMC_Bank2_3)
  ASSERT_PARAM(IS_SMC_SETUP_TIME(Timing->SetupTime));
  ASSERT_PARAM(IS_SMC_WAIT_TIME(Timing->WaitSetupTime));
  ASSERT_PARAM(IS_SMC_HOLD_TIME(Timing->HoldSetupTime));
  ASSERT_PARAM(IS_SMC_HIZ_TIME(Timing->HiZSetupTime));
#endif /* SMC_Bank2_3 */

  /* Set PCCARD timing parameters */
  MODIFY_REG(Device->AMSTIM4, PATT4_CLEAR_MASK,
             (Timing->SetupTime                                              |
              ((Timing->WaitSetupTime) << SMC_AMSTIM4_WAIT4_Pos)  |
              ((Timing->HoldSetupTime) << SMC_AMSTIM4_HLD4_Pos)  |
              ((Timing->HiZSetupTime)  << SMC_AMSTIM4_HIZ4_Pos)));

  return DAL_OK;
}

/**
  * @brief  Initializes the SMC_PCCARD IO space Timing according to the specified
  *         parameters in the SMC_NAND_PCC_TimingTypeDef
  * @param  Device Pointer to PCCARD device instance
  * @param  Timing Pointer to PCCARD timing structure
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_PCCARD_IOSpace_Timing_Init(SMC_PCCARD_TypeDef *Device,
                                                          SMC_NAND_PCC_TimingTypeDef *Timing)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_PCCARD_DEVICE(Device));
#if defined(SMC_Bank2_3)
  ASSERT_PARAM(IS_SMC_SETUP_TIME(Timing->SetupTime));
  ASSERT_PARAM(IS_SMC_WAIT_TIME(Timing->WaitSetupTime));
  ASSERT_PARAM(IS_SMC_HOLD_TIME(Timing->HoldSetupTime));
  ASSERT_PARAM(IS_SMC_HIZ_TIME(Timing->HiZSetupTime));
#endif /* SMC_Bank2_3 */

  /* Set SMC_PCCARD device timing parameters */
  MODIFY_REG(Device->IOSTIM4, PIO4_CLEAR_MASK,
             (Timing->SetupTime                                           |
              (Timing->WaitSetupTime   << SMC_IOSTIM4_WAIT4_Pos) |
              (Timing->HoldSetupTime   << SMC_IOSTIM4_HLD4_Pos) |
              (Timing->HiZSetupTime    << SMC_IOSTIM4_HIZ4_Pos)));

  return DAL_OK;
}

/**
  * @brief  DeInitializes the SMC_PCCARD device
  * @param  Device Pointer to PCCARD device instance
  * @retval DAL status
  */
DAL_StatusTypeDef SMC_PCCARD_DeInit(SMC_PCCARD_TypeDef *Device)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_SMC_PCCARD_DEVICE(Device));

  /* Disable the SMC_PCCARD device */
  __SMC_PCCARD_DISABLE(Device);

  /* De-initialize the SMC_PCCARD device */
  Device->CTRL4     = 0x00000018U;
  Device->STSINT4   = 0x00000040U;
  Device->CMSTIM4   = 0xFCFCFCFCU;
  Device->AMSTIM4   = 0xFCFCFCFCU;
  Device->IOSTIM4   = 0xFCFCFCFCU;

  return DAL_OK;
}

/**
  * @}
  */
#endif /* SMC_Bank4 */


/**
  * @}
  */

/**
  * @}
  */

#endif /* DAL_NOR_MODULE_ENABLED */
/**
  * @}
  */
/**
  * @}
  */
